src/main/java/ok/dht/test/vihnin/resources/report/stage3/profile_results_t4_c10_mput_R30000/wrk_res.txt
Running 1m test @ http://localhost:19235
  4 threads and 10 connections
  Thread calibration: mean lat.: 560.819ms, rate sampling interval: 2349ms
  Thread calibration: mean lat.: 562.009ms, rate sampling interval: 2357ms
  Thread calibration: mean lat.: 585.661ms, rate sampling interval: 2437ms
  Thread calibration: mean lat.: 602.735ms, rate sampling interval: 2451ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.42s     1.35s    8.34s    74.46%
    Req/Sec     6.48k     1.48k    8.39k    68.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.34s 
 75.000%    5.12s 
 90.000%    6.37s 
 99.000%    8.12s 
 99.900%    8.34s 
 99.990%    8.35s 
 99.999%    8.35s 
100.000%    8.35s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1317.887     0.000000           27         1.00
    2079.743     0.100000       129865         1.11
    3862.527     0.200000       260169         1.25
    4005.887     0.300000       390728         1.43
    4143.103     0.400000       520380         1.67
    4341.759     0.500000       650419         2.00
    4448.255     0.550000       715952         2.22
    4558.847     0.600000       780132         2.50
    4628.479     0.650000       846884         2.86
    4706.303     0.700000       909190         3.33
    5124.095     0.750000       973794         4.00
    5246.975     0.775000      1007755         4.44
    5337.087     0.800000      1039330         5.00
    5431.295     0.825000      1072175         5.71
    5533.695     0.850000      1103877         6.67
    6127.615     0.875000      1136315         8.00
    6266.879     0.887500      1152491         8.89
    6365.183     0.900000      1168989        10.00
    6410.239     0.912500      1184664        11.43
    6459.391     0.925000      1201368        13.33
    6533.119     0.937500      1217286        16.00
    6565.887     0.943750      1226145        17.78
    6590.463     0.950000      1233493        20.00
    6709.247     0.956250      1241739        22.86
    6733.823     0.962500      1249977        26.67
    6778.879     0.968750      1257630        32.00
    7598.079     0.971875      1261642        35.56
    7917.567     0.975000      1266156        40.00
    7933.951     0.978125      1270977        45.71
    7979.007     0.981250      1274078        53.33
    8019.967     0.984375      1278544        64.00
    8028.159     0.985938      1279914        71.11
    8101.887     0.987500      1282468        80.00
    8114.175     0.989062      1284430        91.43
    8138.751     0.990625      1286085       106.67
    8151.039     0.992188      1288648       128.00
    8155.135     0.992969      1289038       142.22
    8286.207     0.993750      1290415       160.00
    8290.303     0.994531      1291196       182.86
    8298.495     0.995313      1292188       213.33
    8302.591     0.996094      1293156       256.00
    8306.687     0.996484      1293583       284.44
    8318.975     0.996875      1294304       320.00
    8323.071     0.997266      1294722       365.71
    8327.167     0.997656      1295146       426.67
    8331.263     0.998047      1295830       512.00
    8335.359     0.998242      1296261       568.89
    8335.359     0.998437      1296261       640.00
    8339.455     0.998633      1297238       731.43
    8339.455     0.998828      1297238       853.33
    8339.455     0.999023      1297238      1024.00
    8339.455     0.999121      1297238      1137.78
    8339.455     0.999219      1297238      1280.00
    8343.551     0.999316      1297857      1462.86
    8343.551     0.999414      1297857      1706.67
    8343.551     0.999512      1297857      2048.00
    8343.551     0.999561      1297857      2275.56
    8343.551     0.999609      1297857      2560.00
    8343.551     0.999658      1297857      2925.71
    8343.551     0.999707      1297857      3413.33
    8343.551     0.999756      1297857      4096.00
    8347.647     0.999780      1298143      4551.11
    8347.647     1.000000      1298143          inf
#[Mean    =     4422.694, StdDeviation   =     1354.495]
#[Max     =     8343.552, Total count    =      1298143]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1557143 requests in 1.00m, 108.65MB read
Requests/sec:  25952.51
Transfer/sec:      1.81MB